src/cf/InformationRegisters/GDS_ОчередьРаспознавания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ОчередьРаспознавания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветИИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.GDS_ЗаправочнаяВедомость</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_СоответсвиеДокументовПисьмам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_СоответсвиеДокументовПисьмам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Успех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛогOCR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеOCRСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.GDS_ЗаправочнаяВедомость</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/GDS_РаспознаваниеВходящихПисем/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Распозновние писем
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Процедура GDS_ОбработатьОчередьРаспознавания() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.GDS_ОбработатьОчередьРаспознавания);
	
	ДокументыДляРаспознавания = ДокументыДляРаспознавания();
	Пока ДокументыДляРаспознавания.Следующий() Цикл
		
		Документ = ДокументыДляРаспознавания.Документ;
		Обработка = Обработки.GDS_РаспознаваниеИИ.Создать();
		Результат = Обработка.РаспознатьВедомость(Документ);
		
		РегистрыСведений.GDS_ОчередьРаспознавания.ЗаписатьВыполнение(Документ, Результат.ДанныеJSON);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура GDS_ОбработатьВходящиеПисьмаРаспознать() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.GDS_ОбработатьВходящиеПисьмаРаспознать);
	
	Обработка = Обработки.GDS_ЗагрузкаЗаправочныхВедомостей.Создать();
	Письма = Обработка.СписокПисемДяОбработки();
	Для Каждого СтрокаПисьма Из Письма Цикл
		
		Результат = Обработка.ОбработатьПисьмо(СтрокаПисьма.Письмо);
		
		ЗаписатьСоответсвие(
			Результат.Ведомость, 
			СтрокаПисьма.Письмо, 
			Результат.Успех, 
			Результат.ТекстОшибки,
			Результат.ЛогOCR,
			Результат.ДанныеOCRСтрока
		);
		
		GDS_ИнтеграцияС1СДокументооборот3.ОтправитьВДокументооборот(Результат.Ведомость);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДокументПоПисьму(Письмо) Экспорт
	
	Возврат РегистрыСведений.GDS_СоответсвиеДокументовПисьмам.ДокументПоПисьму(Письмо);
	
КонецФункции

Функция ТСПоГаражномуНомеру(ГаражныйНомер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	уатТС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатТС КАК уатТС
	|ГДЕ
	|	уатТС.ГаражныйНомер = &ГаражныйНомер
	|	И НЕ уатТС.ПометкаУдаления";
	Запрос.УстановитьПараметр("ГаражныйНомер", ГаражныйНомер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.уатТС.ПустаяСсылка();
	
КонецФункции

Процедура ЗаписатьСоответсвие(Документ, Письмо, Успех = Ложь, ТекстОшибки = "", ЛогOCR = "", ДанныеOCRСтрока = "") Экспорт
	
	РегистрыСведений.GDS_СоответсвиеДокументовПисьмам.ЗаписатьСоответсвие(Документ, Письмо, Успех, ТекстОшибки, ЛогOCR, ДанныеOCRСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДокументыДляРаспознавания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	GDS_ОчередьРаспознаванияСрезПоследних.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.GDS_ОчередьРаспознавания.СрезПоследних КАК GDS_ОчередьРаспознаванияСрезПоследних
	|ГДЕ
	|	НЕ GDS_ОчередьРаспознаванияСрезПоследних.Обработан";
	
	Возврат Запрос.Выполнить().Выбрать();
	
	
КонецФункции

#КонецОбласти
